benchmarks/cospec_benchmark_results_20250526_020721_facebook/opt-13b_facebook/opt-350m_tp2_dtp2/baseline_0_0.6_8_sharegpt_output.txt
INFO 05-26 03:28:42 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8003, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='facebook/opt-13b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=8.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.6, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Split dataset into 8126 test samples and 73136 training samples
Temperature:  0.6
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8003/health
Server is ready!
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8003/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 8.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     1781      
Benchmark duration (s):                  300.26    
Total input tokens:                      421078    
Total generated tokens:                  367309    
Request throughput (req/s):              5.93      
Output token throughput (tok/s):         1223.31   
Total Token throughput (tok/s):          2625.69   
---------------Time to First Token----------------
Mean TTFT (ms):                          16665.32  
Median TTFT (ms):                        17172.01  
P99 TTFT (ms):                           42745.47  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          100.86    
Median TPOT (ms):                        104.54    
P99 TPOT (ms):                           152.01    
---------------Inter-token Latency----------------
Mean ITL (ms):                           100.70    
Median ITL (ms):                         85.21     
P99 ITL (ms):                            305.99    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          37328.12  
Median E2EL (ms):                        35418.36  
P99 E2EL (ms):                           113418.00 
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 655.32    
Median Token Latency (ms):               171.70    
P99 Token Latency (ms):                  6083.56   
==================================================