benchmarks/cospec_benchmark_results_20250526_020721_facebook/opt-13b_facebook/opt-350m_tp2_dtp2/baseline_3_0_8_sharegpt_output.txt
INFO 05-26 06:42:23 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8003, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='facebook/opt-13b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=8.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Split dataset into 8126 test samples and 73136 training samples
Temperature:  0.0
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8003/health
Server is ready!
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8003/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 8.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     1660      
Benchmark duration (s):                  300.19    
Total input tokens:                      390523    
Total generated tokens:                  347480    
Request throughput (req/s):              5.53      
Output token throughput (tok/s):         1157.52   
Total Token throughput (tok/s):          2458.42   
---------------Time to First Token----------------
Mean TTFT (ms):                          24010.41  
Median TTFT (ms):                        23190.93  
P99 TTFT (ms):                           60933.21  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          121.70    
Median TPOT (ms):                        110.22    
P99 TPOT (ms):                           287.56    
---------------Inter-token Latency----------------
Mean ITL (ms):                           366.24    
Median ITL (ms):                         324.92    
P99 ITL (ms):                            842.65    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          45195.54  
Median E2EL (ms):                        45999.12  
P99 E2EL (ms):                           119530.35 
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 895.27    
Median Token Latency (ms):               222.63    
P99 Token Latency (ms):                  8747.69   
==================================================